# تعریف لیست
# numbers = []
# اعضای داخل لیست می توانند از هر نوعی باشند
# منظور از نوع : عدد، رشته، لیست و ...می باشد
# لیست قابل پیمایش می باشد، یعنی می توانیم هر یک از مقادیر خانه های لیست را بخوانیم و یا تغییر دهیم
# یعنی می توانیم روی لیست حرکت کنیم
# به شماره خانه های لیست ایندکس گفته می شود
# تعریف لیست با اعداد داخل آن
# ایندکس صفر لیست یعنی خانه شماره صفر از لیست
# numbers = [1,2,3,4,5,9]
# برای دسترسی به اعضای لیست به صورت زیر عمل می شود
# مثلا خواندن مقدار خانه شماره صفر لیست
# print(numbers[0])

# برای تغییر مقدار خانه شماره صفر لیست
# numbers[0] = 100
# print(numbers)


# سوال شماره 3 امتحان اول
numbers = []
# برای استفاده از حلقه وایل می بایست کارهای زیر را انجام بدهی:
# اول تعریف شمارنده
# دوم : شرط حلقه
# سوم : آپدیت کردن شمارنده
# i = 100
# while i <= 250:
#     if i % 3 == 0:
#         numbers.append(i)

#     i += 1
# print(numbers)
# import turtle
# pen = turtle.Pen()
# pen.circle(50)
# turtle.done()

# exercise 1:
'''
برنامه ای بنویسید که یک لیست از اعداد بسازد
و اعضای لیست را از انتها به ابتدا نمایش دهد

تعداد اعداد = سه تا

حتما از حلقه استفاده کنید
اعداد را از ورودی دریافت نمائید
'''
# exercise 2
'''
برنامه ای بنویسید که اعداد لیست بالا را مرتب نماید 
به صورت صعودی یعنی از کوچک به بزرگ

'''
# number = [1,2,4,6,3,2,1,6,7,88,4,1,88]
# exercise 3:
'''
از لیست بالا تکراری ها را حذف نمائید
یعنی از هر عدد فقط یکی در لیست وجود داشته باشد
'''

